openFoam/flow_past_cylinder/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 1 -1 0 0 0 0];

internalField uniform (5 0 0);

boundaryField
{
 top
 {
 type symmetryPlane;
 }
 bottom
 {
 type symmetryPlane;
 }
 inlet
 {
 type freestream;
 freestreamValue uniform (5 0 0);
 }
 outlet
 {
 type freestream;
 freestreamValue uniform (5 0 0);
 }
 cylinder
 {
 type fixedValue;
value uniform (0 0 0);
 }
 frontAndBack
 {
 type empty;
 }
}

// ************************************************************************* //
