openFoam/flow_past_cylinder/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;
vertices
(
(0.5 0 -0.5)
(1 0 -0.5)
(10 0 -0.5)
(10 0.707107 -0.5)
(0.707107 0.707107 -0.5)
(0.353553 0.353553 -0.5)
(10 2 -0.5)
(0.707107 2 -0.5)
(0 2 -0.5)
(0 1 -0.5)
(0 0.5 -0.5)
(-0.5 0 -0.5)
(-1 0 -0.5)
(-2 0 -0.5)
(-2 0.707107 -0.5)
(-0.707107 0.707107 -0.5)
(-0.353553 0.353553 -0.5)
(-2 2 -0.5)
(-0.707107 2 -0.5)
(0.5 0 0.5)
(1 0 0.5)
(10 0 0.5)
(10 0.707107 0.5)
(0.707107 0.707107 0.5)
(0.353553 0.353553 0.5)
(10 2 0.5)
(0.707107 2 0.5)
(0 2 0.5)
(0 1 0.5)
(0 0.5 0.5)
(-0.5 0 0.5)
(-1 0 0.5)
(-2 0 0.5)
(-2 0.707107 0.5)
(-0.707107 0.707107 0.5)
(-0.353553 0.353553 0.5)
(-2 2 0.5)
(-0.707107 2 0.5)

(10 -0.707107 -0.5)
(0.707107 -0.707107 -0.5)
(0.353553 -0.353553 -0.5)
(10 -2 -0.5)
(0.707107 -2 -0.5)
(0 -2 -0.5)
(0 -1 -0.5)
(0 -0.5 -0.5)
(-2 -0.707107 -0.5)
(-0.707107 -0.707107 -0.5)
(-0.353553 -0.353553 -0.5)
(-2 -2 -0.5)
(-0.707107 -2 -0.5)
(10 -0.707107 0.5)
(0.707107 -0.707107 0.5)
(0.353553 -0.353553 0.5)
(10 -2 0.5)
(0.707107 -2 0.5)
(0 -2 0.5)
(0 -1 0.5)
(0 -0.5 0.5)
(-2 -0.707107 0.5)
(-0.707107 -0.707107 0.5)
(-0.353553 -0.353553 0.5)
(-2 -2 0.5)
(-0.707107 -2 0.5)
);
blocks
(
hex (5 4 9 10 24 23 28 29) (80 20 1) simpleGrading (10 1 1)
hex (0 1 4 5 19 20 23 24) (80 20 1) simpleGrading (10 1 1)
hex (1 2 3 4 20 21 22 23) (200 20 1) simpleGrading (1 1 1)
hex (4 3 6 7 23 22 25 26) (200 40 1) simpleGrading (1 1 1)
hex (9 4 7 8 28 23 26 27) (20 40 1) simpleGrading (1 1 1)
hex (16 10 9 15 35 29 28 34) (20 80 1) simpleGrading (1 10 1)
hex (11 16 15 12 30 35 34 31) (20 80 1) simpleGrading (1 10 1)
hex (12 15 14 13 31 34 33 32) (20 20 1) simpleGrading (1 1 1)
hex (15 18 17 14 34 37 36 33) (40 20 1) simpleGrading (1 1 1)
hex (9 8 18 15 28 27 37 34) (40 20 1) simpleGrading (1 1 1)
hex (40 45 44 39 53 58 57 52) (20 80 1) simpleGrading (1 10 1)
hex (0 40 39 1 19 53 52 20) (20 80 1) simpleGrading (1 10 1)
hex (1 39 38 2 20 52 51 21) (20 200 1) simpleGrading (1 1 1)
hex (39 42 41 38 52 55 54 51) (40 200 1) simpleGrading (1 1 1)
hex (44 43 42 39 57 56 55 52) (40 20 1) simpleGrading (1 1 1)
hex (48 47 44 45 61 60 57 58) (80 20 1) simpleGrading (10 1 1)
hex (11 12 47 48 30 31 60 61) (80 20 1) simpleGrading (10 1 1)
hex (12 13 46 47 31 32 59 60) (20 20 1) simpleGrading (1 1 1)
hex (47 46 49 50 60 59 62 63) (20 40 1) simpleGrading (1 1 1)
hex (44 47 50 43 57 60 63 56) (20 40 1) simpleGrading (1 1 1)
);
edges
(
arc 0 5 (0.469846 0.17101 -0.5)
arc 5 10 (0.17101 0.469846 -0.5)

arc 1 4 (0.939693 0.34202 -0.5)
arc 4 9 (0.34202 0.939693 -0.5)
arc 19 24 (0.469846 0.17101 0.5)
arc 24 29 (0.17101 0.469846 0.5)
arc 20 23 (0.939693 0.34202 0.5)
arc 23 28 (0.34202 0.939693 0.5)
arc 11 16 (-0.469846 0.17101 -0.5)
arc 16 10 (-0.17101 0.469846 -0.5)
arc 12 15 (-0.939693 0.34202 -0.5)
arc 15 9 (-0.34202 0.939693 -0.5)
arc 30 35 (-0.469846 0.17101 0.5)
arc 35 29 (-0.17101 0.469846 0.5)
arc 31 34 (-0.939693 0.34202 0.5)
arc 34 28 (-0.34202 0.939693 0.5)
arc 0 40 (0.469846 -0.17101 -0.5)
arc 40 45 (0.17101 -0.469846 -0.5)
arc 1 39 (0.939693 -0.34202 -0.5)
arc 39 44 (0.34202 -0.939693 -0.5)
arc 19 53 (0.469846 -0.17101 0.5)
arc 53 58 (0.17101 -0.469846 0.5)
arc 20 52 (0.939693 -0.34202 0.5)
arc 52 57 (0.34202 -0.939693 0.5)
arc 11 48 (-0.469846 -0.17101 -0.5)
arc 48 45 (-0.17101 -0.469846 -0.5)
arc 12 47 (-0.939693 -0.34202 -0.5)
arc 47 44 (-0.34202 -0.939693 -0.5)
arc 30 61 (-0.469846 -0.17101 0.5)
arc 61 58 (-0.17101 -0.469846 0.5)
arc 31 60 (-0.939693 -0.34202 0.5)
arc 60 57 (-0.34202 -0.939693 0.5)
);

boundary
(
 top
 {
   type symmetryPlane;
   faces
   (
   (7 8 27 26)
   (6 7 26 25)
   (8 18 37 27)
   (18 17 36 37)
   );
   }

   bottom
   {
   type symmetryPlane;
   faces
   (
   (49 50 63 62)
   (50 43 56 63)
   (43 42 55 56)
   (42 41 54 55)
   );
   }

   inlet
   {
   type patch;
   faces
   (
   (14 13 32 33)
   (17 14 33 36)
   (46 13 32 59)
   (46 49 62 59)
   );
   }

   outlet
   {
   type patch;
   faces
   (
   (2 3 22 21)
   (3 6 25 22)
   (38 51 21 2)
   (41 54 51 38)
   );
   }

   cylinder
   {
   type wall;
   faces
   (
      (10 5 24 29)
      (5 0 19 24)
      (16 10 29 35)
      (11 16 35 30)
      (48 11 30 61)
      (45 48 61 58)
      (40 45 58 53)
      (0 40 53 19)
   );
   }

   frontAndBack
   {
   type empty;
   faces
   (
      (5 10 9 4)
      (24 23 28 29)
      (0 5 4 1)
      (19 20 23 24)
      (1 4 3 2)
       (20 21 22 23)
       (4 7 6 3)
       (23 22 25 26)
       (4 9 8 7)
       (28 23 26 27)
       (16 15 9 10)
       (35 29 28 34)
       (12 15 16 11)
       (31 30 35 34)
       (13 14 15 12)
       (32 31 34 33)
       (14 17 18 15)
       (33 34 37 36)
       (15 18 8 9)
       (34 28 27 37)
       (45 40 39 44)
       (58 57 52 53)
       (40 0 1 39)
       (53 52 20 19)
       (39 1 2 38)
       (52 51 21 20)
       (39 38 41 42)
       (52 55 54 51)
       (44 39 42 43)
       (57 56 55 52)
       (47 48 45 44)
       (60 57 58 61)
       (12 11 48 47)
       (31 60 61 30)
       (13 12 47 46)
       (32 59 60 31)
       (49 46 47 50)
       (62 63 60 59)
       (50 47 44 43)
       (63 56 57 60)
      );
      }
   );

mergePatchPairs
(
);


// ************************************************************************* //
